Revit 2027 API
UpdaterRegistry.RegisterUpdater(IUpdater, Document) Method
 Registers the updater for a specified document, which means the updater can only be triggered by changes made in that document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RegisterUpdater(
	IUpdater updater,
	Document document
)
Public Shared Sub RegisterUpdater (
	updater As IUpdater,
	document As Document
)
public:
static void RegisterUpdater(
	IUpdater^ updater,
	Document^ document
)
static member RegisterUpdater :
        updater : IUpdater *
        document : Document -> unit
Parameters
updater IUpdater
 Updater to be registered
document Document
 Document for which this updater is to be registered
Exceptions
Exception | Condition
ArgumentException |  Updater with the the same Id has already been registered on the application level. -or- Updater with the the same Id has already been registered either in the given document or on the application level. -or- Updater's Id is not valid.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Method is not allowed during execution of a dynamic update. -or- The updater's owner's AddIn does not match the currently active AddIn, i.e. IUpdater.GetUpdaterId().GetAddInId() differs from the addInId field in the manifest file of the currently executing external application.
Remarks
 An updater may be registered in more than one document, but an updater may not be registered for a document and also for the entire application at the same time. If an updater has already been registered application-wide, an attempt to register it for a document will cause an exception.
See Also
Reference
UpdaterRegistry Class
RegisterUpdater Overload
Autodesk.Revit.DB Namespace